# -*- coding: utf-8 -*-
# @Time    : 2023/4/20 20:56
# @Author  : yanfa
# @user   : yanfa 
# @File    : object_oriented.py
# @remark:面向对象概念
""""""
"""一、面向对象是什么
python是一门面向对象的语言
面向对象编程oop：object oriented Programming
所谓的面向对象，就是在编程的时候尽可能的去模拟真实的现实世界，按照现实世界中的逻辑去处理问题
，分析问题中参与其中的有哪些实体，这些实体应该有什么属性和方法，我们如何通过调用这些实体的
属性和方法去解决问题。
"""

"""二、两种编程思想
面向过程：
一种以过程为中心的编程思想
首先分析解决问题所需要的步骤
然后用函数将这些步骤一步一步的实现
最后按顺序依次调用执行

面向对象：
是一种更符合我们人类思维习惯的编程思想
面向对象开发是不断创建对象，使用对象，操作对象做事
可以将复杂的事情简单化"""

"""三、类与对象
类：class 用来描述具有相同属性和方法的对象的集合。它定义了集合中每个对象共有的属性和方法
对象：object 也成为示例，是一个具体存在的实体 静态-属性（头发） 动态-行为（吃饭）"""